from math import * 
print("Квадратные характеристики")
a = float(input('Ввести длину квадратной стороны => '))
S=a**2
print("Квадратная площадь", S)
P=4*a
print("Квадратная окружность", P)
di=a * sqrt(2)
print("Квадратная диагональ", round(di , 2))

print("Характеристики прямоугольника")
b=float(input("Ввести прямоугольник 1-й длины => "))
c=float(input("Вставить прямоугольник 2. длина стороны => "))
S=b*c
print("Площадь прямоугольника", S)
P = 2 * (b + c)
print("Окружность прямоугольника", P)
di = sqrt(b**2 + c**2)
print("Диагональ прямоугольника", round(di , 2))
print()
print("Характеристики окружности")
r=2
r = float(input("Ввести радиусы круга длина => "))
d = 2 * r
print("Диаметр окружка", d)
S = pi * r * r
print("Круг площадь", round(S))
C=2 * pi * r
print("Длина круга", round(C))